!Задание 2

!Тема: Ряды (циклы, итерации).
!Операторы DO используются для организации циклических расчетов.
!Цикл — это последовательность операторов, которая может автоматически
!выполняться более одного раза. Если количество повторов известно заранее (или
!может быть однозначно вычислено), используется оператор «Цикл с параметром»
!(DO «UNTIL»). Если количество повторов неизвестно, применяется оператор
!«Цикл с предусловием» (DO «WHILE»).

!Вычислить сумму ряда:
!a) с заданной точностью ξ и вывести количество итераций;
!b) для 20-ти членов ряда.
!Σ = 1 – х 2 /2! + х 4 /4! – х 6 /6! + ...
!х= π
!ξ=0.000001
!Ответ: -1 (b)

program var8_zad2









end
