!Задание 3

!Тема: Сложные типы данных.
!Одномерные массивы (вектора).
!Вводится одномерный вещественный массив фиксированной длины, состоящий из
!«N» элементов (конкретное значение N для каждого студента индивидуально
!задается преподавателем). Требуется: 1) Вывести исходный массив в строку
!(например, 23.5 45.1 и т.д.). 2) Заменить все отрицательные элементы массива на
!первый положительный элемент (например, -1 -2 6 -36 0 -4 9 -7 ... — здесь первым
!положительным элементом является число 6). Вывести измененный массив в том
!же виде что и исходный, но со следующей строки.

program var8_zad3











end
